[
  {
    "room"     : "entrance",
    "description"     : [
      "As you enter the castle, a shiver wracks your body as the temperature plummets  despite the harvest sun.  A ghost's screams seem to come from everywhere.  He lunges towards you baring white ethereal teeth.  What do you do?",
      "You are at the entrance of the castle.  The floating candles have settled on the ground, and the ghostly figure (named Casper) has shrunken to a size you can put in your pocket.  The door to leave the castle is shut, but it seems like the door on the right is ajar.",
      "You are at the entrance of the castle.  The floating candles have settled on the ground, and the room remains empty.  The door to leave the castle is shut, but it seems like the door on the right is ajar."
    ],
    "items"    : [],
    "monsters" : ["ghost"]
  },
  {
    "room"     : "foyer",
    "description"     : [
      "A beautiful staircase leads up to two doors.  One that has been nailed shut so strongly it appears that not even the best magic in the world could pry open this door.  The other is a dark metal door with a keyhole drilled deep inside the recess.  As if the tower is mocking us, a key lays next to the door.",
      "A beautiful staircase leads up to two doors.  One that has been nailed shut so strongly it appears that not even the best magic in the world could pry open this door.  The other is a dark metal door with a keyhole drilled deep inside the recess.  The keyhole is so deeply drilled into the door that your hand cannot fit inside. To the left you have the castle entrance, and to the right you have what might possibly be the kitchen.\n",
      "You enter a foyer at the beginning of the castle.  The floating candles have settled on the ground, and the room remains empty.  The door to leave the castle is shut, but it seems like the door on the right is ajar."
    ],
    "items"    : ["key"],
    "monsters" : ["key"]
  },
  {
    "room"     : "kitchen",
    "description"     : [
      "You enter a once beautiful kitchen, full of what seems to be magical cooking appliances unbeknownst to you.  Wires connect a metal box spitting out blackened bread, and a type of wood stove expels heat from its open furnace at a remarkable heat despite there being no wood.  The top of the stove has four discs burning as bright and red and angry as an armorsmith’s furnace.  Fire leaps from a pot on top of one those burning disc just as a horrific repeating squeal comes a tiny circle on the wall.  Seemingly unphased by the obvious chaos around and possible inevitable conflagration, a goblin leaps from chair to table to wall and spots you but seems to not care.  In between several leaps it belches and throws its shoulders against the kitchen island that has been upturned and sits squarely against the pantry door.  What do you do?",
      "Wow.  The king and queen are not going to be happy to hear about the state of their poor kitchen.  Luckily at least the food still looks pretty good in here.  The magic cold box is still frigid too.  I wonder whats inside?  The only way out of the kitchen is to the left back to the foyer.",
      "Ugh.  The kitchen again.  Really starting to smell in here.  Glad I was sent to slay and not to clean.  The only way out is to the left."
    ],
    "items"    : [],
    "monsters" : ["goblin"]
  },
  {
    "room"     : "plaisure",
    "description"     : [
      "A succubus is hiding behind the door.  She whispers in your ear --- \"I can give you great pleasure.  Do you dare reject me?\"",
      "Should never see this",
      "The succubus just sits in the room.  Oblivious to everyone.  Above you have the parlor, and below you have the foyer."
    ],
    "items"    : [],
    "monsters" : ["succubus"]
  },
  {
    "room"     : "den",
    "description"     : [
      "A direbear is shaking off the winter snow.  He looks very hungry, but may still talk to you.",
      "A tiny teddybear lies contentedly on the floor.  Perhaps you should pick it up?  Below you have the Plaisure, above you have the parlor",
      "Den complete"
    ],
    "items"    : [],
    "monsters" : ["direbear"]
  },
  {
    "room"     : "Parlor",
    "description"     : [
      "A werewolf is growling at you from the center of the parlor.  In a cracking voice he says: \"I don't want to hurt you. I'm ugly and I can't stop from changing.  I've never had hair in all these places before.  I need someone to TEACH me what's going on with me\" ",
      "Should never see this",
      "The werewolf is scratching his fleas but pays no mind to you.  Above you have the ballroom, below you have the den, and to the right you have the bed chambers."
    ],
    "items"    : [],
    "monsters" : ["werewolf"]
  },
  {
    "room"     : "Bed Chambers",
    "description"     : [
      "An impossibly handsome vampire sits on an ottoman in the center of a gigantic bedchambers.  A beautiful chandelier catches the light and throws it around the room.  The pale man hangs his head in his hands and doesn't even bother looking up when you enter.  The weirdest thing is the vanity mirror being covered by a blanket.",
      "Should never see this",
      "You enter the bedchambers to find the vampire just staring at himself in the mirror.  Like... ok we get it, you're beautiful.  To the left you have the den."
    ],
    "items"    : [],
    "monsters" : ["vampire"]
  },
  {
    "room"     : "Ballroom",
    "description"     : [
      "A zombie is slow dancing in the center of the large ballroom.  His arms are up in the air like he's trying to dance with someone.  He keeps saying \"Fren, fren, fren\" over and over.  Ugh... maybe he wants to dance with you?",
      "Should never see this",
      "A zombie is slow dancing in the center of the large ballroom with the ghost."
    ],
    "items"    : [],
    "monsters" : ["zombie"]
  },
  {
    "room"     : "Conservatory",
    "description"     : [
      "An Alien.  He's scared.  Won't look outside.  There's a window.  Try to comfort him.",
      "Should never see this",
      "As you enter the conservatory a warm breeze greets you from the open window.  The alien is still there, but he's looking out the window now.  Below you have the ballroom.  Up you have the bedroom."
    ],
    "items"    : [],
    "monsters" : ["alien"]
  },
  {
    "room"     : "Bedroom",
    "description"     : [
      "Prince Timore is there.  He's so scared.  You should try and give him something",
      "Should never see this",
      "You beat the game."
    ],
    "items"    : [],
    "monsters" : ["prince"]
  }
]