[
  {
    "room"     : "entrance",
    "description"     : [
      "As you enter the castle, a shiver wracks your body as the temperature plummets  despite the harvest sun.  The stench of death stains your senses; the thick and  muggy room is seen through your quickly watering eyes.  Candles throughout the room cast sickening shadows dancing along the walls, and the sound of weeping permeates everything.  It comes from nowhere and everywhere.  As the shiver finishes arresting your body, your mind wonders if the crying is coming from inside your own mind, but then you see the source.  A ghost seems to phase in and out of existence at the front of the room, but completely frozen mid-step towards you with both feet six inches off the cobble floor.  All happiness drains from you as you look down to draw your sword.  As you do this you look up and the ghost has made an obvious dash to you, but has re-froze after its untethered rush.  You blink in disbelief and fearfully realize it is now inches closer despite never seeing it actually move.  The crying grows louder, almost desperate.  What do you do?",
      "You are at the entrance of the castle.  The floating candles have settled on the ground, and the ghostly figure has shrunken to a size you can put in your pocket.  The door to leave the castle is shut, but it seems like the door on the right is ajar.",
      "You are at the entrance of the castle.  The floating candles have settled on the ground, and the room remains empty.  The door to leave the castle is shut, but it seems like the door on the right is ajar."
    ],
    "items"    : [],
    "monsters" : ["ghost"]
  },
  {
    "room"     : "foyer",
    "description"     : [
      "A beautiful staircase leads up to two doors.  One that has been nailed shut so strongly it appears that not even the best magic in the world could pry open this door.  The other is a dark metal door with a keyhole drilled deep inside the recess.  As if the tower is mocking us, a key lays next to the door.",
      "A beautiful staircase leads up to two doors.  One that has been nailed shut so strongly it appears that not even the best magic in the world could pry open this door.  The other is a dark metal door with a keyhole drilled deep inside the recess.  The keyhole is so deeply drilled into the door that your hand cannot fit inside. To the left you have the castle entrance, and to the right you have what might possibly be the kitchen.\n",
      "You enter a foyer at the beginning of the castle.  The floating candles have settled on the ground, and the room remains empty.  The door to leave the castle is shut, but it seems like the door on the right is ajar."
    ],
    "items"    : ["key"],
    "monsters" : ["key"]
  },
  {
    "room"     : "kitchen",
    "description"     : [
      "You enter a once beautiful kitchen, full of what seems to be magical cooking appliances unbeknownst to you.  Wires connect a metal box spitting out blackened bread.  More wires from the wall go to what appears to be a mini crane furiously spinning a metallic whip inside a bowl throwing cow’s milk across the white marbled countertop.  A type of wood stove expels heat from its open furnace at a remarkable heat despite there being no wood.  Cold air spills out of a compartmented box as frozen water leaks out of the top and various liquids spill out of the bottom half from flimsy transparent vessels.  The top of the stove has four discs burning as bright and red and angry as an armorsmith’s furnace.  Fire leaps from a pot on top of one those burning disc just as a horrific repeating squeal comes a tiny circle on the wall.\n    Seemingly unphased by the obvious chaos around and possible inevitable conflagration, a goblin leaps from chair to table to wall and spots you but seems to not care.  In between several leaps it belches and throws its shoulders against the kitchen island that has been upturned and sits squarely against the pantry door.  The goblin’s voice squeals at the top of it’s obviously oversized lungs: “WEEK WEAK WEEK WEAK SHRIEK AGAIN PARVUS BECAUSE youWEEK  areWEAK WEEK” while shouldering the upturned island once more before turning it’s comically oversized eyes upon you.  What do you do?",
      "Wow.  The king and queen are not going to be happy to hear about the state of their poor kitchen.  Luckily at least the food still looks pretty good in here.  The magic cold box is still frigid too.  I wonder whats inside?  The only way out of the kitchen is to the left back to the foyer.",
      "Ugh.  The kitchen again.  Really starting to smell in here.  Glad I was sent to slay and not to clean.  The only way out is to the left."
    ],
    "items"    : [],
    "monsters" : ["goblin"]
  }
]